/*
Вывести на экран соответствий между символами и их численными обозначениями в памяти ПК
*/
public class loopSix {
	public static void main(String[] args) {
		int a = 'a'; // first way
		char b = 'b'; // second way
		char c = 'c';
		
		System.out.println(a);
		System.out.println((int)b);
		System.out.println((int)c);
	}
}